; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
(define (problem floortile-64)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_0_4
    tile_0_5
    tile_1_1
    tile_1_2
    tile_1_3
    tile_1_4
    tile_1_5
    tile_2_1
    tile_2_2
    tile_2_3
    tile_2_4
    tile_2_5
    tile_3_1
    tile_3_2
    tile_3_3
    tile_3_4
    tile_3_5
    tile_4_1
    tile_4_2
    tile_4_3
    tile_4_4
    tile_4_5
    tile_5_1
    tile_5_2
    tile_5_3
    tile_5_4
    tile_5_5 - tile
    robot1
    robot2 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_0_4)
    (robot-has robot1 white)
    (robot-at robot2 tile_3_2)
    (robot-has robot2 black)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_3)
    (clear tile_0_5)
    (clear tile_1_1)
    (clear tile_1_2)
    (clear tile_1_3)
    (clear tile_1_4)
    (clear tile_1_5)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_2_4)
    (clear tile_2_5)
    (clear tile_3_1)
    (clear tile_3_3)
    (clear tile_3_4)
    (clear tile_3_5)
    (clear tile_4_1)
    (clear tile_4_2)
    (clear tile_4_3)
    (clear tile_4_4)
    (clear tile_4_5)
    (clear tile_5_1)
    (clear tile_5_2)
    (clear tile_5_3)
    (clear tile_5_4)
    (clear tile_5_5)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_1_4 tile_0_4 )
    (up tile_1_5 tile_0_5 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_2_4 tile_1_4 )
    (up tile_2_5 tile_1_5 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_3_4 tile_2_4 )
    (up tile_3_5 tile_2_5 )
    (up tile_4_1 tile_3_1 )
    (up tile_4_2 tile_3_2 )
    (up tile_4_3 tile_3_3 )
    (up tile_4_4 tile_3_4 )
    (up tile_4_5 tile_3_5 )
    (up tile_5_1 tile_4_1 )
    (up tile_5_2 tile_4_2 )
    (up tile_5_3 tile_4_3 )
    (up tile_5_4 tile_4_4 )
    (up tile_5_5 tile_4_5 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_0_4 tile_1_4 )
    (down tile_0_5 tile_1_5 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_1_4 tile_2_4 )
    (down tile_1_5 tile_2_5 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_2_4 tile_3_4 )
    (down tile_2_5 tile_3_5 )
    (down tile_3_1 tile_4_1 )
    (down tile_3_2 tile_4_2 )
    (down tile_3_3 tile_4_3 )
    (down tile_3_4 tile_4_4 )
    (down tile_3_5 tile_4_5 )
    (down tile_4_1 tile_5_1 )
    (down tile_4_2 tile_5_2 )
    (down tile_4_3 tile_5_3 )
    (down tile_4_4 tile_5_4 )
    (down tile_4_5 tile_5_5 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_0_3 tile_0_4 )
    (left tile_0_4 tile_0_5 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_1_3 tile_1_4 )
    (left tile_1_4 tile_1_5 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_2_3 tile_2_4 )
    (left tile_2_4 tile_2_5 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_3_3 tile_3_4 )
    (left tile_3_4 tile_3_5 )
    (left tile_4_1 tile_4_2 )
    (left tile_4_2 tile_4_3 )
    (left tile_4_3 tile_4_4 )
    (left tile_4_4 tile_4_5 )
    (left tile_5_1 tile_5_2 )
    (left tile_5_2 tile_5_3 )
    (left tile_5_3 tile_5_4 )
    (left tile_5_4 tile_5_5 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_0_4 tile_0_3 )
    (right tile_0_5 tile_0_4 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_1_4 tile_1_3 )
    (right tile_1_5 tile_1_4 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_2_4 tile_2_3 )
    (right tile_2_5 tile_2_4 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_3_4 tile_3_3 )
    (right tile_3_5 tile_3_4 )
    (right tile_4_2 tile_4_1 )
    (right tile_4_3 tile_4_2 )
    (right tile_4_4 tile_4_3 )
    (right tile_4_5 tile_4_4 )
    (right tile_5_2 tile_5_1 )
    (right tile_5_3 tile_5_2 )
    (right tile_5_4 tile_5_3 )
    (right tile_5_5 tile_5_4 ))
 (:goal (and 
(painted tile_5_1 white)
(painted tile_4_1 black)
(painted tile_3_1 white)
(painted tile_2_1 black)
(painted tile_1_1 white)
(painted tile_5_2 black)
(painted tile_4_2 white)
(painted tile_3_2 black)
))
)

; plan
1. (move_up robot2 tile_3_2 tile_4_2)
   deleted: (robot-at robot2 tile_3_2) (clear tile_4_2)
   added: (robot-at robot2 tile_4_2) (clear tile_3_2)
   goals met: 0 of 8
2. (paint_up robot2 tile_5_2 tile_4_2 black)
   deleted: (clear tile_5_2)
   added: (painted tile_5_2 black)
   goals met: 1 of 8
3. (move_left robot2 tile_4_2 tile_4_1)
   deleted: (robot-at robot2 tile_4_2) (clear tile_4_1)
   added: (robot-at robot2 tile_4_1) (clear tile_4_2)
   goals met: 1 of 8
4. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 1 of 8
5. (paint_up robot2 tile_5_1 tile_4_1 white)
   deleted: (clear tile_5_1)
   added: (painted tile_5_1 white)
   goals met: 2 of 8
6. (move_down robot2 tile_4_1 tile_3_1)
   deleted: (robot-at robot2 tile_4_1) (clear tile_3_1)
   added: (robot-at robot2 tile_3_1) (clear tile_4_1)
   goals met: 2 of 8
7. (move_right robot2 tile_3_1 tile_3_2)
   deleted: (robot-at robot2 tile_3_1) (clear tile_3_2)
   added: (robot-at robot2 tile_3_2) (clear tile_3_1)
   goals met: 2 of 8
8. (paint_up robot2 tile_4_2 tile_3_2 white)
   deleted: (clear tile_4_2)
   added: (painted tile_4_2 white)
   goals met: 3 of 8
9. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 3 of 8
10. (move_left robot2 tile_3_2 tile_3_1)
   deleted: (robot-at robot2 tile_3_2) (clear tile_3_1)
   added: (robot-at robot2 tile_3_1) (clear tile_3_2)
   goals met: 3 of 8
11. (paint_up robot2 tile_4_1 tile_3_1 black)
   deleted: (clear tile_4_1)
   added: (painted tile_4_1 black)
   goals met: 4 of 8
12. (move_down robot2 tile_3_1 tile_2_1)
   deleted: (robot-at robot2 tile_3_1) (clear tile_2_1)
   added: (robot-at robot2 tile_2_1) (clear tile_3_1)
   goals met: 4 of 8
13. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 4 of 8
14. (paint_up robot2 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 5 of 8
15. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 5 of 8
16. (move_right robot2 tile_2_1 tile_2_2)
   deleted: (robot-at robot2 tile_2_1) (clear tile_2_2)
   added: (robot-at robot2 tile_2_2) (clear tile_2_1)
   goals met: 5 of 8
17. (paint_up robot2 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 6 of 8
18. (move_down robot2 tile_2_2 tile_1_2)
   deleted: (robot-at robot2 tile_2_2) (clear tile_1_2)
   added: (robot-at robot2 tile_1_2) (clear tile_2_2)
   goals met: 6 of 8
19. (move_left robot2 tile_1_2 tile_1_1)
   deleted: (robot-at robot2 tile_1_2) (clear tile_1_1)
   added: (robot-at robot2 tile_1_1) (clear tile_1_2)
   goals met: 6 of 8
20. (paint_up robot2 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 7 of 8
21. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 7 of 8
22. (move_down robot2 tile_1_1 tile_0_1)
   deleted: (robot-at robot2 tile_1_1) (clear tile_0_1)
   added: (robot-at robot2 tile_0_1) (clear tile_1_1)
   goals met: 7 of 8
23. (paint_up robot2 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 8 of 8
